Repository: dekel5030/CoursePlatformMicroServices
Catalog: UserService/Resources/ValidationMessages.*.resx
Languages: he

# FullNameRequired
source: Full name is required.
he: יש להזין שם מלא.

# FullNameInvalidLength
source: Full name must be between {0} and {1} characters long.
he: השם המלא צריך להכיל בין {0} ל־{1} תווים.

# EmailRequired
source: Email is required.
he: יש להזין אימייל.

# EmailInvalid
source: Invalid email format.
he: פורמט האימייל אינו תקין.

# PasswordRequired
source: Password is required.
he: יש להזין סיסמה.

# PasswordTooShort
source: Password must be at least {0} characters long.
he: הסיסמה צריכה להכיל לפחות {0} תווים.

# ConfirmPasswordRequired
source: Confirm password is required.
he: יש להזין אישור סיסמה.

# ConfirmPasswordDoesNotMatch
source: Confirm password must match password.
he: אישור הסיסמה לא תואם לסיסמה.

# PhoneNumberInvalid
source: Phone number must be in a valid format, e.g. +972XXXXXXXXX or 05XXXXXXXX.
he: יש להזין מספר טלפון תקני, לדוגמה +972XXXXXXXXX או 05XXXXXXXX.

# DateOfBirthMustBeInPast
source: Date of birth must be in the past.
he: תאריך הלידה חייב להיות בעבר.

# BioMaxLength
source: Bio must not exceed 500 characters.
he: הביוגרפיה לא יכולה להכיל יותר מ־500 תווים.
